notes/A2--Software-and-tools.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-02 Wed 17:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software and tools</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="Documentation on required and recommended software/tools"
 />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Software and tools</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Introduction">1. Introduction</a>
<ul>
<li><a href="#*IMPORTANT*:-Your-responsibilities">1.1. <b>IMPORTANT</b>: Your responsibilities</a></li>
</ul>
</li>
<li><a href="#Docker">2. Docker</a>
<ul>
<li><a href="#Getting-started-with-Docker">2.1. <span class="todo TODO">TODO</span> Getting started with Docker</a></li>
</ul>
</li>
<li><a href="#Editors">3. Editors</a></li>
<li><a href="#Version-control">4. Version control</a></li>
<li><a href="#Online-communication">5. Online communication</a></li>
<li><a href="#Language-implementations">6. Programming languages and their implementations</a>
<ul>
<li><a href="#Scala">6.1. Scala&#xa0;&#xa0;&#xa0;<span class="tag"><span class="functional">functional</span>&#xa0;<span class="objectoriented">objectoriented</span></span></a></li>
<li><a href="#Prolog">6.2. Prolog&#xa0;&#xa0;&#xa0;<span class="tag"><span class="logical">logical</span></span></a></li>
<li><a href="#Ruby">6.3. Ruby&#xa0;&#xa0;&#xa0;<span class="tag"><span class="objectoriented">objectoriented</span>&#xa0;<span class="scripting">scripting</span></span></a></li>
<li><a href="#Clojure">6.4. Clojure&#xa0;&#xa0;&#xa0;<span class="tag"><span class="functional">functional</span>&#xa0;<span class="LISP">LISP</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga90a099" class="outline-2">
<h2 id="Introduction"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-Introduction">
<p>
This document discusses the software and tools needed
for CS3mi3, Principles of Programming Languages, for the fall 2020 session.
</p>
</div>

<div id="outline-container-org4212037" class="outline-3">
<h3 id="*IMPORTANT*:-Your-responsibilities"><span class="section-number-3">1.1</span> <b>IMPORTANT</b>: Your responsibilities</h3>
<div class="outline-text-3" id="text-*IMPORTANT*:-Your-responsibilities">
<div class="org-center">
<p>
It is not the responsibility of the instructor or the teaching assistants
to install the required software and tools on your system.
</p>

<p>
We will provide docker images for testing submissions, along with
basic usage instructions.
Installing and learning the basics of Docker is your own responsibility.
</p>

<p>
We recommend installation of the programming environments and tools
locally on your own system for your convenience
while working on the assignments.
This setup is your own responsibility.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org44b7436" class="outline-2">
<h2 id="Docker"><span class="section-number-2">2</span> Docker</h2>
<div class="outline-text-2" id="text-Docker">
<p>
We will use Docker to ensure a common testing environment
for all students and staff.
</p>

<p>
Docker images will be distributed which setup the required
language tools for each assignment and include some sanity-checking
unit tests for your code.
</p>

<p>
Similar images with more complete unit tests will make up part
of the marking process of assignments.
</p>
</div>

<div id="outline-container-org9b5f422" class="outline-3">
<h3 id="Getting-started-with-Docker"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> Getting started with Docker</h3>
<div class="outline-text-3" id="text-Getting-started-with-Docker">
</div>
</div>
</div>

<div id="outline-container-orge653340" class="outline-2">
<h2 id="Editors"><span class="section-number-2">3</span> Editors</h2>
<div class="outline-text-2" id="text-Editors">
<p>
Any text editor should be adequate for use in this course.
I recommend against “full-fledged IDEs”; it is likely
some languages we use will not be supported by any choice of IDE.
</p>

<p>
I do recommend <a href="https://www.gnu.org/software/emacs/">Emacs</a> as a text editor,
though warn that its use involves a steep learning curve
and likely a long configuration time
—most likely an unending configuration time.
The <a href="https://www.spacemacs.org/">Spacemacs</a> and <a href="https://github.com/hlissner/doom-emacs">Doom (Emacs)</a> configurations alleviate at least some
of the setup time; they are preconfigured with many commonly used features
and support for many programming languages.
</p>

<p>
<a href="https://atom.io/">Atom</a>, <a href="https://code.visualstudio.com/">VS Code</a> and
<a href="https://www.sublimetext.com/">Sublime Text</a> are
other extensible text editors, any of which is also
an excellent choice.
</p>
</div>
</div>

<div id="outline-container-orgeed7fb3" class="outline-2">
<h2 id="Version-control"><span class="section-number-2">4</span> Version control</h2>
<div class="outline-text-2" id="text-Version-control">
<p>
We make frequent use of Git throughout this course for
version control.
</p>

<p>
We will make use of the
<a href="https://github.com/armkeh/principles-of-programming-languages">course GitHub repository</a>
and its
<a href="https://armkeh.github.io/principles-of-programming-languages/">github.io website</a>
for course content distribution.
</p>

<p>
A repository on the
<a href="https://gitlab.cas.mcmaster.ca/">CAS departmental Gitlab server</a>
will be created for each student for course work submission,
as your accounts there are tied to your macid.
</p>
</div>
</div>

<div id="outline-container-org96322fc" class="outline-2">
<h2 id="Online-communication"><span class="section-number-2">5</span> Online communication</h2>
<div class="outline-text-2" id="text-Online-communication">
<p>
Online communications,
<b>including for this term all lectures and tutorials</b>,
will be conducted using
<a href="https://teams.microsoft.com">Microsoft Teams</a>.
</p>

<p>
By the beginning of the course, you should have access to
a Team for the course when logging in using your McMaster email
and MacID password.
</p>
</div>
</div>

<div id="outline-container-org58e073d" class="outline-2">
<h2 id="Language-implementations"><span class="section-number-2">6</span> Programming languages and their implementations</h2>
<div class="outline-text-2" id="text-Language-implementations">
<p>
We plan to use four programming languages
for homework and assignments throughout the course.
Each language will require an implementation to be installed.
</p>

<p>
This section provides information on those implementations,
as well as some additional resources for each language.
</p>
</div>

<div id="outline-container-orga96f955" class="outline-3">
<h3 id="Scala"><span class="section-number-3">6.1</span> Scala&#xa0;&#xa0;&#xa0;<span class="tag"><span class="functional">functional</span>&#xa0;<span class="objectoriented">objectoriented</span></span></h3>
<div class="outline-text-3" id="text-Scala">
<p>
A Java-descended, <i>pure</i> object oriented language
with full functional programming support on the JVM.
</p>

<ul class="org-ul">
<li>The Scala <a href="https://scala-lang.org/">homepage</a>.</li>
<li><a href="https://www.handsonscala.com/index.html">Hands-on Scala Programming</a>,
a very recent book with the first few chapters available freely online.</li>
</ul>
</div>
</div>

<div id="outline-container-orgefb5ba3" class="outline-3">
<h3 id="Prolog"><span class="section-number-3">6.2</span> Prolog&#xa0;&#xa0;&#xa0;<span class="tag"><span class="logical">logical</span></span></h3>
<div class="outline-text-3" id="text-Prolog">
<p>
The prevalent logical programming language.
Program by <i>describing the problem</i>, rather than providing an algorithms. 
</p>
</div>
</div>

<div id="outline-container-orgf1470ed" class="outline-3">
<h3 id="Ruby"><span class="section-number-3">6.3</span> Ruby&#xa0;&#xa0;&#xa0;<span class="tag"><span class="objectoriented">objectoriented</span>&#xa0;<span class="scripting">scripting</span></span></h3>
<div class="outline-text-3" id="text-Ruby">
<p>
A <i>nearly pure</i> object-oriented <i>scripting</i> language
featuring extremely flexible syntax.
</p>
</div>
</div>

<div id="outline-container-org27c16d9" class="outline-3">
<h3 id="Clojure"><span class="section-number-3">6.4</span> Clojure&#xa0;&#xa0;&#xa0;<span class="tag"><span class="functional">functional</span>&#xa0;<span class="LISP">LISP</span></span></h3>
<div class="outline-text-3" id="text-Clojure">
<p>
A Lisp (LISt Programming) functional language on the JVM.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Armstrong</p>
     <p class="author">Contact: <a href="mailto:armstmp@mcmaster.ca">armstmp@mcmaster.ca</a></p>
     <p class="date">Original date: </p>
     <p class="date">Last updated: 2020-09-02 Wed 17:21</p>
     <p class="creator">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.90 (<a href="https://orgmode.org">Org</a> mode 9.3.7)</p>
     <p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
